# 課題

# 準備
DROP TABLE test_db.users;
SHOW TABLES FROM test_db;

CREATE TABLE IF NOT EXISTS test_db.users (
    id INT PRIMARY KEY
    ,
family_name VARCHAR(255) NOT NULL
    ,
first_name VARCHAR(255) NOT NULL
    , nickname VARCHAR(255)
    , prefecture VARCHAR(10) NOT NULL
    , phone_number VARCHAR(11) NOT NULL
    , age INT NOT NULL
    , created_at DATETIME NOT NULL
    , updated_at DATETIME NOT NULL
);

SHOW CREATE TABLE test_db.users;

INSERT
    INTO
    test_db.users
VALUES (
    1
    , "山田"
    , "太郎"
    , "やまぽん"
    , "東京都"
    , "09011111111"
    , 22
    , "2022-01-01 12:01:11"
    , "2022-01-01 12:01:11"
)
, (
    2
    , "田中"
    , "次郎"
    , "たなか"
    , "東京都"
    , "09022222222"
    , 30
    , "2022-03-02 10:53:20"
    , "2022-04-01 20:31:47"
)
, (
    3
    , "佐藤"
    , "隆"
    , "たかくん"
    , "大阪府"
    , "09033333333"
    , 18
    , "2022-03-01 21:23:55"
    , "2022-05-11 16:02:13"
)
, (
    4
    , "松本"
    , "健斗"
    , NULL
    , "宮崎県"
    , "09044444444"
    , 35
    , "2021-11-21 14:05:42"
    , "2022-01-02 17:52:12"
)
, (
    5
    , "坂本"
    , "太郎"
    , "たろくん"
    , "滋賀県"
    , "09055555555"
    , 17
    , "2021-06-02 23:41:44"
    , "2021-12-10 09:47:29"
)
, (
    6
    , "飯島"
    , "隆平"
    , NULL
    , "東京都"
    , "09066666666"
    , 24
    , "2021-12-31 22:00:12"
    , "2022-01-04 14:07:51"
)
, (
    7
    , "藤本"
    , "翔也"
    , "しょう"
    , "東京都"
    , "09077777777"
    , 44
    , "2022-03-24"
    , "2022-05-01 04:01:02"
)
, (
    8
    , "山本"
    , "圭佑"
    , "やまっち"
    , "北海道"
    , "09077777777"
    , 39
    , "2021-09-03 19:56:39"
    , "2022-03-16 09:42:56"
)
, (
    9
    , "服部"
    , "誠司"
    , "はっとり"
    , "鹿児島県"
    , "09099999999"
    , 29
    , "2022-01-02 06:47:22"
    , "2022-06-29 06:35:43"
)
, (
    10
    , "城田"
    , "浩二"
    , "こうくん"
    , "石川県"
    , "09011112222"
    , 20
    , "2021-12-20 21:01:24"
    , "2022-04-13 10:37:52"
);

SELECT * FROM users;